
#include "gbafe.h"

typedef struct CreatorClassProcStruct CreatorClassProcStruct;
typedef struct Struct_SelectCharacterProc Struct_SelectCharacterProc;
typedef struct SomeAISStruct SomeAISStruct;

extern const MenuDefinition gSelectUnitMenuDefs;

int RestartSelectCharacter_ASMC(struct MenuProc* menu, struct MenuCommandProc* command);
void SelectCharacter_ASMC(Proc* proc);
void SelectCharacter_StartMenu(struct Struct_SelectCharacterProc* proc);
static int SelectClass(struct MenuProc* menu, struct MenuCommandProc* command);
static int SelectYes(struct MenuProc* menu, struct MenuCommandProc* command);
static int SelectNo(struct MenuProc* menu, struct MenuCommandProc* command);
void SelectCharacterMenuEnd_ReturnTrue(void); // Exited menu selecting "yes" - write 1 to memory slot C 
void SelectCharacterMenuEnd_ReturnFalse(void); // Exited menu by pressing B - write 0 to memory slot C 
void SelectCharacterMenuEnd(void);
static void DrawSelectCharacterCommands(struct MenuProc* menu, struct MenuCommandProc* command);
static void CallSwitchInCharacter(MenuProc* proc);
static void SwitchInCharacter(void);
static void SwitchOutCharacter(MenuProc* proc, MenuCommandProc* commandProc);
static void StartPlatform(CreatorClassProcStruct* proc);
static void CreatorClassEndProc(CreatorClassProcStruct* proc);
static const struct MenuDefinition MenuDef_SelectCharacter1;
static const struct MenuDefinition MenuDef_SelectCharacter2;
static const struct MenuDefinition MenuDef_SelectCharacter3;
static const struct MenuDefinition MenuDef_SelectCharacter4;
static const struct MenuDefinition MenuDef_SelectCharacter5;
static void DrawYes(struct MenuProc* menu, struct MenuCommandProc* command);
static void DrawNo(struct MenuProc* menu, struct MenuCommandProc* command);

typedef struct Tile Tile;
typedef struct TSA TSA;
struct Tile
{
	u16 tileID : 10;
	u16 horizontalFlip : 1;
	u16 verticalFlip : 1;
	u16 paletteID : 4;
};

struct TSA
{
	u8 width, height;
	Tile tiles[];
};
struct CreatorClassProcStruct
{
	PROC_HEADER
	u8 destructorBool;
	u8 unk1[0x2C-0x2a]; // 0x29.
	u16 classes[5]; // 0x2C.
	u8 unk2[0x40 - 0x36]; // 0x36.
	u8 mode; // 0x40.
	u8 menuItem; // 0x41.
	u16 charID; // 0x42.
	u8 unk3[0x50 - 0x44]; // 0x44.
	u8 platformType; // 0x50.
};

struct SomeAISStruct {};

#define DrawSkillIcon(map,id,oam2base) DrawIcon(map,id|0x100,oam2base)

extern u16 gBG2MapBuffer[32][32]; // 0x02023CA8.
extern AnimationInterpreter gSomeAISStruct; // 0x030053A0.
extern SomeAISStruct gSomeAISRelatedStruct; // 0x0201FADC.

extern u8 gCharacterSelectorBattleSpriteHeight, gCharacterSelectorPlatformHeight;

extern TSA gTopStatsUIBoxTSA;
extern TSA gBottomStatsUIBoxTSA;
extern TSA gCostUIBoxTSA;
extern TSA gItemUIBoxTSA;
extern TSA gPortraitUIBoxTSA;
extern TSA gSkillsRanksUIBoxTSA;
extern u16 gBG0MapBuffer[32][32]; // 0x02022CA8. Snek: Ew why does FE-CLib-master not do it like this?
extern u16 gBG1MapBuffer[32][32]; // 0x020234A8.

extern void StartMovingPlatform(int always0x9, int always0x118, int height); // 0x080CD408.
extern void SetupMovingPlatform(int always0x0, int alwaysNeg1, int always0x1F6, int always0x58, int always0x6); // 0x080CD47C.
extern void DeleteSomeAISStuff(AnimationInterpreter* interpreter); // 0x0805AA28.
extern void DeleteSomeAISProcs(struct SomeAISStruct* obj); // 0x0805AE14.
extern void EndEkrAnimeDrvProc(void);
extern AIStruct gAISArray; // 0x2028F78.

extern void LockGameGraphicsLogic(void); // Hide map sprites? ! FE8U = 0x8030185
extern void UnlockGameGraphicsLogic(void); //! FE8U = 0x80301B9
extern void MU_AllDisable(void);
extern void MU_AllEnable(void); 


extern unsigned gEventSlot[];

extern MenuCommandDefinition gRAMMenuCommands[]; // 0x0203EFB8.

static void DrawStatNames(TextHandle handle, char* string, int x, int y);

extern void CreatorClassSetup();
extern void CreatorClassDisplayLoop();


struct Struct_SelectCharacterProc
{
	PROC_HEADER;
	u8 destructorBool; // 0x29.
	u8 platformType; // 0x2A.
	u8 currOptionIndex; // 0x2B. 0 = first option, 1 = 2nd option, etc. 
	Unit* activeUnit; // 0x2C. 
	struct
	{
		Unit* unitRam; // 0x30, 0x34, 0x38, 0x3c, 0x40, 0x44 
	} list[5];
};

struct Struct_ConfirmationProc
{
	PROC_HEADER;
};

void CreatorIdle(Struct_SelectCharacterProc* proc)
{

}

static const struct ProcInstruction ProcInstruction_SelectCharacter[] =
{
	
    PROC_CALL_ROUTINE(LockGameLogic),
	PROC_CALL_ROUTINE(LockGameGraphicsLogic),
	PROC_CALL_ROUTINE(MU_AllDisable), 
	PROC_YIELD,
	

	PROC_CALL_ROUTINE(SelectCharacter_StartMenu),

	PROC_LABEL(0),
    PROC_LOOP_ROUTINE(CreatorIdle),

	PROC_LABEL(1),
	PROC_END_ALL(0x85B64D1), //#define MenuProc 0x5B64D0
	PROC_CALL_ROUTINE(UnlockGameLogic),
	PROC_CALL_ROUTINE(UnlockGameGraphicsLogic), 
	PROC_CALL_ROUTINE(MU_AllEnable),
	
    PROC_END,
};





static const struct ProcInstruction ProcInstruction_CreatorClassProc[] =
{
	PROC_YIELD,
	PROC_CALL_ROUTINE(SwitchInCharacter), 
	PROC_CALL_ROUTINE(StartPlatform),
	PROC_LOOP_ROUTINE(CreatorClassDisplayLoop),
	PROC_CALL_ROUTINE(CreatorClassEndProc),
	PROC_END, 
}; 

